{
  "siteTitle": "Yakup Delil Akın | Softwareentwickler & Designer",
  "nav-home": "Startseite",
  "nav-projects": "Projekte",
  "nav-about": "Über mich",
  "nav-contact": "Kontakt",
  "hero-badge": "Kreativer Webentwickler",
  "hero-titlePart1": "Design",
  "hero-titlePart2": "Das",
  "hero-titlePart3": "Wirkt",
  "hero-description": "Ich bin Yakup Delil Akın. Ich verbinde Ästhetik mit leistungsstarkem Code, um unvergessliche digitale Erlebnisse für Marken zu schaffen.",
  "scroll-text": "Nach unten scrollen • Nach unten scrollen • Nach unten scrollen •",
  "marquee-item1": "Kreative Entwicklung",
  "marquee-item2": "UI/UX Strategie",
  "marquee-item3": "Immersives 3D Web",
  "marquee-item4": "Webentwicklung",
  "portfolio-sectionTitle": "Portfolio",
  "portfolio-selectedProjects": "Ausgewählte Projekte",
  "portfolio-description": "Jedes Projekt erzählt eine einzigartige Geschichte an der Schnittstelle von Technologie und Kunst.",
  "portfolio-viewAll": "Alle Projekte ansehen",
  "about-sectionTitle": "Über mich",
  "about-heading": "Die Ästhetik des Codes, Die Intelligenz des Designs.",
  "about-p1": "Ich bin Yakup Delil Akın, ein kreativer Entwickler, der sich darauf konzentriert, Produkte zu entwickeln, die in der digitalen Welt einen Unterschied machen.",
  "about-p2": "Ich harmoniere technische Fähigkeiten mit Designvision, um flüssige, bedeutungsvolle digitale Reisen zu schaffen, in denen sich Benutzer verlieren möchten. Ich liebe es, Grenzen mit modernen Technologien zu überschreiten.",
  "about-p3": "Ich bin auch kompetent in Programmiersprachen wie Python und C++. Ich habe verschiedene Projekte in diesen Sprachen entwickelt, um meine Fähigkeiten in der Softwarewelt zu erweitern.",
  "about-expertiseTitle": "Expertise",
  "about-expertise1": "Frontend-Architektur",
  "about-expertise2": "Interaktives 3D Web",
  "about-expertise3": "Motion Graphics",
  "about-expertise4": "Produktdesign",
  "about-toolsTitle": "Tools",
  "about-tool1": "Next.js / React",
  "about-tool2": "Git / GitHub",
  "about-tool3": "Figma / tailwind",
  "about-tool4": "VS Code",
  "about-dilTitle": "Programmiersprachen",
  "about-dil1": "JavaScript",
  "about-dil2": "Python",
  "about-dil3": "C++",
  "about-dil4": "Java",
  "about-dil5": "HTML5",
  "about-dil6": "CSS3",
  "contact-sectionTitle": "Lassen Sie uns zusammenarbeiten",
  "contact-heading": "Lass uns einen Kaffee trinken",
  "coffee": "Lass uns einen Kaffee trinken",
  "social-instagram": "Instagram",
  "social-linkedin": "LinkedIn",
  "social-github": "GitHub",
  "social-dribbble": "Dribbble",
  "footer-copyright": "© 2026 Yakup Delil Akın. Alle Rechte vorbehalten.",
  "footer-profession": "Webentwickler",
  "medibot-badge": "Gesundheitstechnologie / KI",
  "medibot-title": "MediBot",
  "medibot-description": "KI-gestützter Bildungs- und Gesundheitsassistent, entwickelt für das Teknofest, der grundlegende Gesundheitsinformationen und Anleitungen bietet.",
  "medibot-purpose-title": "Projektzweck",
  "medibot-purpose-desc": "Dieser Bot wurde entwickelt, um die Gesundheitskompetenz zu verbessern. Er bietet allgemeine Informationen basierend auf Benutzersymptomen und leitet bei Bedarf an einen Facharzt weiter. Dank der Integration von Large Language Models (LLM) kann er Fragen in natürlicher Sprache beantworten.",
  "medibot-role-value": "Teammitglied - Backend & KI",
  "phantomlabs-badge": "Cybersicherheit",
  "phantomlabs-title": "Phantom",
  "phantomlabs-description": "Umfassendes Offline-Endpunktanalyse-Framework, entwickelt für die forensische Sicherheitsforschung.",
  "phantomlabs-section-challenges": "Herausforderungen",
  "phantomlabs-challenge-1": "Konsistente und sichere Erkennung von Systemartefakten (Prefetch, Temp, Ereignisprotokolle) auf verschiedenen Windows-Versionen (Win10/11), während alles vollständig offline und clientseitig läuft – ohne Störung durch Antivirensoftware.",
  "phantomlabs-challenge-2": "Präzise Messung und Berichterstattung von Umweltdaten wie CPU-Temperatur, Batteriezyklus und Festplattennutzung über verschiedene Hardwarekonfigurationen hinweg (wenig RAM/CPU, alte Prozessoren).",
  "phantomlabs-challenge-3": "Nichtveröffentlichung des vollständigen Quellcodes, um das Missbrauchsrisiko zu minimieren, während der logische Ablauf für Bildungszwecke effektiv demonstriert wird und sichergestellt wird, dass der Selbstreinigungsmechanismus einwandfrei funktioniert.",
  "phantomlabs-challenge-4": "Sicherstellung der Verhaltenskonsistenz über verschiedene Testumgebungen hinweg (virtuelle Maschine, physisches Gerät, Domäne beigetreten vs. eigenständig) und Abschluss des Analysezyklus ohne Hinterlassung forensisch sicherer Artefakte.",
  "phantomlabs-section-system": "Wie das System funktioniert",
  "phantomlabs-system-1": "<span class=\"font-medium text-white\">Inventarsammlung:</span> CPU, RAM, Betriebssystemversion, installierte Sicherheitssoftware und Hardwareinformationen werden gesammelt; alle Daten werden in die lokale system_report.txt-Datei geschrieben.",
  "phantomlabs-system-2": "<span class=\"font-medium text-white\">Netzwerk- und Konnektivitätsanalyse:</span> Lokale IP, Netzwerkschnittstellen und grundlegendes Konnektivitäts-Mapping werden durchgeführt (Offline-Module werden für die Netzwerkerkennung verwendet).",
  "phantomlabs-system-3": "<span class=\"font-medium text-white\">Medien- und Peripherietest:</span> Die Hardwarekompatibilität wird per Screenshot und Kameratreibertest überprüft (peripheral_test.jpg wird erstellt).",
  "phantomlabs-system-4": "<span class=\"font-medium text-white\">Artefakt- und Forensiküberwachung:</span> Windows Prefetch, Temp-Ordner und andere digitale Spuren werden gescannt; vom Software auf dem System hinterlassene Fußabdrücke werden gemeldet.",
  "phantomlabs-system-5": "<span class=\"font-medium text-white\">Umweltüberwachung:</span> Metriken wie CPU-Temperatur, Batteriezyklusanzahl und Festplattennutzungsrate werden in der health_log.txt-Datei aufgezeichnet.",
  "phantomlabs-system-6": "<span class=\"font-medium text-white\">Bereinigung und Abschluss:</span> Nach Abschluss der Analyse werden alle temporären Protokoll- und Artefaktdateien automatisch gelöscht (Selbstreinigung & Endreinigung); das System kehrt ohne Spuren in seinen ursprünglichen Zustand zurück.",
  "phantomlabs-section-tech": "Technische Entscheidungen",
  "phantomlabs-tech-1": "Alle Analysevorgänge laufen vollständig offline und lokal – keine Daten werden an das Netzwerk oder den Server gesendet; um 100% Privatsphäre und forensische Sicherheit zu gewährleisten.",
  "phantomlabs-tech-2": "Die Systemintegrität wird auch im Bildungseinsatz durch modulare Struktur (jede Version fügt einen separaten Fokusbereich hinzu) und Debug-/Selbstreinigungsmechanismen gewahrt.",
  "phantomlabs-tech-3": "Der vollständige Quellcode wird nicht veröffentlicht; nur Beispiele, die den logischen Ablauf zeigen, werden geteilt – eine bewusste Entscheidung, um das Missbrauchsrisiko zu minimieren.",
  "phantomlabs-tech-4": "Umweltmetriken (Temperatur, Batterie, Festplatte) werden mit psutil oder ähnlichen Bibliotheken abgerufen; optimiert für geringen Ressourcenverbrauch.",
  "phantomlabs-tech-5": "Der Analysezyklus wurde durch eine dreistufige Methodik (Inventar → Verhaltensbeobachtung → Bereinigung) mit digitalen Forensikstandards in Einklang gebracht.",
  "phantomlabs-section-results": "Ergebnisse",
  "phantomlabs-result-1": "Ab v13.0 ist ein umfassendes Offline-Endpunktanalyse-Framework abgeschlossen; alle Module sind integriert und hinterlassen dank Selbstreinigung keine Spuren.",
  "phantomlabs-result-2": "Artefakterkennung und Umweltüberwachung funktionierten in verschiedenen Testumgebungen (Win10/11, Hardware der unteren bis mittleren Preisklasse) zu 100% konsistent.",
  "phantomlabs-result-3": "Es gelang, Systemanalysemethoden für Bildungszwecke effektiv zu demonstrieren; das Missbrauchsrisiko wurde nahe Null gehalten.",
  "phantomlabs-result-4": "Es wurde zu einem sicheren Bildungswerkzeug für ethische Sicherheitsforschung ohne Netzwerkabhängigkeit und vollständig lokaler Verarbeitung.",
  "project-info-title": "Projektinfo",
  "project-year-label": "Jahr",
  "project-role-label": "Rolle",
  "project-role-value": "Design & Full Stack Entwicklung (Solo)",
  "project-tech-label": "Technologien",
  "project-links-title": "Live-Links",
  "link-demo": "Live Demo",
  "link-repo": "GitHub Repository",
  "athleticocore-badge": "Computer Vision / Sporttechnologie",
  "athleticocore-title": "AthleticoCore",
  "athleticocore-description": "Ein Echtzeit-Computer-Vision-System, das vollständig im Browser läuft, die Liegestützform über den Kameraeingang analysiert, Wiederholungen zählt und Leistungskennzahlen generiert.",
  "athleticocore-section-challenges": "Herausforderungen",
  "athleticocore-challenge-1": "Aufrechterhaltung von Echtzeit 25+ FPS auf Geräten der unteren bis mittleren Preisklasse",
  "athleticocore-challenge-2": "Genaue Winkelberechnung bei verschiedenen Körpertypen und Lichtverhältnissen",
  "athleticocore-challenge-3": "Browser-Kameraberechtigungen und Datenschutzkonformität",
  "athleticocore-section-system": "Wie das System funktioniert",
  "athleticocore-system-1": "Der Kameraeingang wird über WebRTC erfasst.",
  "athleticocore-system-2": "Gelenkpunkte werden mit MediaPipe Pose extrahiert.",
  "athleticocore-system-3": "Winkel und Bewegungsdaten werden in Echtzeit berechnet.",
  "athleticocore-system-4": "Sofortiges Feedback wird gegeben, wenn sich die Form verschlechtert.",
  "athleticocore-system-5": "Die Analyseintensität wird automatisch reduziert, wenn die FPS sinken.",
  "athleticocore-section-tech": "Technische Entscheidungen",
  "athleticocore-tech-1": "Die gesamte Analyse läuft vollständig clientseitig, um die Latenz zu minimieren.",
  "athleticocore-tech-2": "Die Inferenzfrequenz wird reduziert, wenn die FPS unter 20 fallen.",
  "athleticocore-tech-3": "Die Auflösung wird automatisch für mobile Geräte optimiert.",
  "athleticocore-tech-4": "Es werden keine Kameradaten an externe Server gesendet.",
  "athleticocore-section-results": "Ergebnisse",
  "athleticocore-result-1": "Durchschnittlich 28 FPS Echtzeitanalyse.",
  "athleticocore-result-2": "Über 83% Genauigkeit bei der Formerkennung in Testsets.",
  "athleticocore-result-3": "Sichtbare Steigerung der Benutzermotivation.",
  "athleticocore-back": "Alle Projekte ansehen",
  "athletico-title": "Athletico",
  "athletico-badge": "PWA / Sport-Tracking",
  "athletico-description": "Entwickelt, um Sportler von manuellen Trainingsverfolgungsmethoden zu befreien. Bietet volle Offline-Fähigkeit, lokale Datenspeicherung und Cloud-Synchronisierung mit Supabase.",
  "athletico-section-challenges": "Herausforderungen",
  "athletico-challenge-1": "Offline-First-Architektur und Datensynchronisierung",
  "athletico-challenge-2": "Leistungsoptimierung auf mobilen Geräten",
  "athletico-challenge-3": "Sichere Speicherung und Datenschutz von Benutzerdaten",
  "athletico-section-results": "Erreichte Ergebnisse",
  "athletico-result-1": "Reibungsloses Erlebnis auch im vollständigen Offline-Modus",
  "athletico-result-2": "Echtzeit-Datensynchronisierung mit Supabase",
  "athletico-result-3": "40% schnellere Dateneingabe in Benutzertests",
  "projeler-title": "Projekte | YDA."
}