{
  "siteTitle": "Yakup Delil Akın | Desarrollador de Software y Diseñador",
  "nav-home": "Inicio",
  "nav-projects": "Proyectos",
  "nav-about": "Acerca de",
  "nav-contact": "Contacto",
  "hero-badge": "Desarrollador Web Creativo",
  "hero-titlePart1": "Diseño",
  "hero-titlePart2": "Que",
  "hero-titlePart3": "Impacta",
  "hero-description": "Soy Yakup Delil Akın. Combino estética con código de alto rendimiento para crear experiencias digitales inolvidables para marcas.",
  "scroll-text": "Desplazarse • Desplazarse • Desplazarse •",
  "marquee-item1": "Desarrollo Creativo",
  "marquee-item2": "Estrategia UI/UX",
  "marquee-item3": "Web 3D Inmersiva",
  "marquee-item4": "Desarrollo Web",
  "portfolio-sectionTitle": "Portafolio",
  "portfolio-selectedProjects": "Proyectos Destacados",
  "portfolio-description": "Cada proyecto cuenta una historia única en la intersección de la tecnología y el arte.",
  "portfolio-viewAll": "Ver Todos los Proyectos",
  "about-sectionTitle": "Sobre mí",
  "about-heading": "La Estética del Código, La Inteligencia del Diseño.",
  "about-p1": "Soy Yakup Delil Akın, un desarrollador creativo enfocado en construir productos que marcan la diferencia en el mundo digital.",
  "about-p2": "Armonizo habilidades técnicas con visión de diseño para crear viajes digitales fluidos y significativos en los que los usuarios quieran perderse. Me encanta superar los límites con tecnologías modernas.",
  "about-p3": "También soy competente en lenguajes de programación como Python y C++. He desarrollado varios proyectos en estos lenguajes para ampliar mis habilidades en el mundo del software.",
  "about-expertiseTitle": "Experiencia",
  "about-expertise1": "Arquitectura Frontend",
  "about-expertise2": "Web 3D Interactiva",
  "about-expertise3": "Gráficos en Movimiento",
  "about-expertise4": "Diseño de Producto",
  "about-toolsTitle": "Herramientas",
  "about-tool1": "Next.js / React",
  "about-tool2": "Git / GitHub",
  "about-tool3": "Figma / tailwind",
  "about-tool4": "VS Code",
  "about-dilTitle": "Lenguajes de Programación",
  "about-dil1": "JavaScript",
  "about-dil2": "Python",
  "about-dil3": "C++",
  "about-dil4": "Java",
  "about-dil5": "HTML5",
  "about-dil6": "CSS3",
  "contact-sectionTitle": "Trabajemos Juntos",
  "contact-heading": "Tomemos un Café",
  "coffee": "Tomemos un Café",
  "social-instagram": "Instagram",
  "social-linkedin": "LinkedIn",
  "social-github": "GitHub",
  "social-dribbble": "Dribbble",
  "footer-copyright": "© 2026 Yakup Delil Akın. Todos los derechos reservados.",
  "footer-profession": "Desarrollador Web",
  "medibot-badge": "Tecnología de la Salud / IA",
  "medibot-title": "MediBot",
  "medibot-description": "Asistente de educación y salud impulsado por IA desarrollado para Teknofest, que proporciona información básica de salud y orientación.",
  "medibot-purpose-title": "Propósito del Proyecto",
  "medibot-purpose-desc": "Diseñado para aumentar la alfabetización en salud, este bot proporciona información general basada en los síntomas del usuario y lo dirige a un especialista cuando es necesario. Gracias a la integración de Modelos de Lenguaje Grande (LLM), puede responder preguntas en lenguaje natural.",
  "medibot-role-value": "Miembro del Equipo - Backend e IA",
  "phantomlabs-badge": "Seguridad Cibernética",
  "phantomlabs-title": "Phantom",
  "phantomlabs-description": "Marco de análisis de punto final fuera de línea integral desarrollado para la investigación de seguridad forense.",
  "phantomlabs-section-challenges": "Desafíos",
  "phantomlabs-challenge-1": "Detección consistente y segura de artefactos del sistema (Prefetch, Temp, Event Logs) en diferentes versiones de Windows (Win10/11) mientras se ejecuta completamente fuera de línea y del lado del cliente, sin interferencias del software antivirus.",
  "phantomlabs-challenge-2": "Medición precisa e informes de datos ambientales como la temperatura de la CPU, el ciclo de la batería y el uso del disco en varias configuraciones de hardware (RAM/CPU baja, procesadores antiguos).",
  "phantomlabs-challenge-3": "No publicar el código fuente completo para minimizar el riesgo de mal uso, mientras se demuestra efectivamente el flujo lógico con fines educativos y se asegura que el mecanismo de autolimpieza funcione sin problemas.",
  "phantomlabs-challenge-4": "Garantizar la consistencia del comportamiento en diferentes entornos de prueba (máquina virtual, dispositivo físico, unido al dominio frente a independiente) y completar el ciclo de análisis sin dejar artefactos forenses seguros.",
  "phantomlabs-section-system": "Cómo Funciona el Sistema",
  "phantomlabs-system-1": "<span class=\"font-medium text-white\">Recopilación de Inventario:</span> Se recopilan CPU, RAM, versión del sistema operativo, software de seguridad instalado e información de hardware; todos los datos se escriben en el archivo local system_report.txt.",
  "phantomlabs-system-2": "<span class=\"font-medium text-white\">Análisis de Red y Conectividad:</span> Se realizan mapeos de IP local, interfaces de red y conectividad básica (se utilizan módulos fuera de línea para el descubrimiento de redes).",
  "phantomlabs-system-3": "<span class=\"font-medium text-white\">Prueba de Medios y Periféricos:</span> La compatibilidad del hardware se verifica mediante captura de pantalla y prueba del controlador de la cámara (se crea peripheral_test.jpg).",
  "phantomlabs-system-4": "<span class=\"font-medium text-white\">Monitoreo de Artefactos y Forense:</span> Se escanean las carpetas Prefetch, Temp y otros rastros digitales de Windows; se informan las huellas dejadas por el software en el sistema.",
  "phantomlabs-system-5": "<span class=\"font-medium text-white\">Monitoreo Ambiental:</span> Las métricas como la temperatura de la CPU, el recuento de ciclos de la batería y la tasa de uso del disco se registran en el archivo health_log.txt.",
  "phantomlabs-system-6": "<span class=\"font-medium text-white\">Limpieza y Cierre:</span> Después de completar el análisis, todos los archivos de registro y artefactos temporales se eliminan automáticamente (autolimpieza y limpieza final); el sistema vuelve a su estado original sin dejar rastro.",
  "phantomlabs-section-tech": "Decisiones Técnicas",
  "phantomlabs-tech-1": "Todas las operaciones de análisis se ejecutan completamente fuera de línea y localmente: no se envían datos a la red ni al servidor; para garantizar el 100% de privacidad y seguridad forense.",
  "phantomlabs-tech-2": "La integridad del sistema se preserva incluso en uso educativo con estructura modular (cada versión agrega un área de enfoque separada) y mecanismos de depuración/autolimpieza.",
  "phantomlabs-tech-3": "El código fuente completo no se publica; solo se comparten ejemplos que muestran el flujo lógico, una elección consciente para minimizar el riesgo de mal uso.",
  "phantomlabs-tech-4": "Las métricas ambientales (temperatura, batería, disco) se obtienen con psutil o bibliotecas similares; optimizado para un bajo consumo de recursos.",
  "phantomlabs-tech-5": "El ciclo de análisis se hizo compatible con los estándares de forense digital a través de una metodología de tres etapas (inventario → observación del comportamiento → limpieza).",
  "phantomlabs-section-results": "Resultados",
  "phantomlabs-result-1": "A partir de v13.0, se completa un marco de análisis de punto final fuera de línea integral; todos los módulos están integrados y no dejan rastro con la autolimpieza.",
  "phantomlabs-result-2": "La detección de artefactos y el monitoreo ambiental funcionaron al 100% de manera consistente en diferentes entornos de prueba (Win10/11, hardware de gama media-baja).",
  "phantomlabs-result-3": "Logró demostrar efectivamente metodologías de análisis de sistemas para uso educativo; el riesgo de mal uso se mantuvo cerca de cero.",
  "phantomlabs-result-4": "Se convirtió en una herramienta educativa segura para la investigación de seguridad ética con cero dependencia de la red y procesamiento completamente local.",
  "project-info-title": "Info del Proyecto",
  "project-year-label": "Año",
  "project-role-label": "Rol",
  "project-role-value": "Diseño y Desarrollo Full Stack (Solo)",
  "project-tech-label": "Tecnologías",
  "project-links-title": "Enlaces en Vivo",
  "link-demo": "Demo en Vivo",
  "link-repo": "Repositorio GitHub",
  "athleticocore-badge": "Visión por Computadora / Tecnología Deportiva",
  "athleticocore-title": "AthleticoCore",
  "athleticocore-description": "Un sistema de visión por computadora en tiempo real que se ejecuta completamente en el navegador, analiza la forma de las flexiones usando la entrada de la cámara, cuenta las repeticiones y genera métricas de rendimiento.",
  "athleticocore-section-challenges": "Desafíos",
  "athleticocore-challenge-1": "Mantener 25+ FPS en tiempo real en dispositivos de gama media-baja",
  "athleticocore-challenge-2": "Cálculo preciso de ángulos en diferentes tipos de cuerpo e iluminación",
  "athleticocore-challenge-3": "Permisos de cámara del navegador y cumplimiento de la privacidad",
  "athleticocore-section-system": "Cómo Funciona el Sistema",
  "athleticocore-system-1": "La entrada de la cámara se captura a través de WebRTC.",
  "athleticocore-system-2": "Los puntos de referencia de las articulaciones se extraen usando MediaPipe Pose.",
  "athleticocore-system-3": "Los ángulos y datos de movimiento se calculan en tiempo real.",
  "athleticocore-system-4": "Se proporciona retroalimentación instantánea cuando la forma se degrada.",
  "athleticocore-system-5": "La intensidad del análisis se reduce automáticamente cuando bajan los FPS.",
  "athleticocore-section-tech": "Decisiones Técnicas",
  "athleticocore-tech-1": "Todo el análisis se ejecuta completamente en el lado del cliente para minimizar la latencia.",
  "athleticocore-tech-2": "La frecuencia de inferencia se reduce cuando los FPS caen por debajo de 20.",
  "athleticocore-tech-3": "La resolución se optimiza automáticamente para dispositivos móviles.",
  "athleticocore-tech-4": "No se envían datos de la cámara a servidores externos.",
  "athleticocore-section-results": "Resultados",
  "athleticocore-result-1": "Promedio de 28 FPS en análisis en tiempo real.",
  "athleticocore-result-2": "Más del 83% de precisión en la detección de forma en conjuntos de prueba.",
  "athleticocore-result-3": "Aumento visible en la motivación del usuario.",
  "athleticocore-back": "Ver Todos los Proyectos",
  "athletico-title": "Athletico",
  "athletico-badge": "PWA / Seguimiento Deportivo",
  "athletico-description": "Diseñado para liberar a los atletas de los métodos manuales de seguimiento del entrenamiento. Ofrece capacidad completa sin conexión, almacenamiento de datos local y sincronización en la nube con Supabase.",
  "athletico-section-challenges": "Desafíos Enfrentados",
  "athletico-challenge-1": "Arquitectura offline-first y sincronización de datos",
  "athletico-challenge-2": "Optimización del rendimiento en dispositivos móviles",
  "athletico-challenge-3": "Almacenamiento seguro y privacidad de los datos del usuario",
  "athletico-section-results": "Resultados Logrados",
  "athletico-result-1": "Experiencia fluida incluso en modo completamente sin conexión",
  "athletico-result-2": "Sincronización de datos en tiempo real con Supabase",
  "athletico-result-3": "Entrada de datos 40% más rápida en pruebas de usuario",
  "projeler-title": "Proyectos | YDA."
}