{
  "id": "exp-001",
  "title": "PROJECT: S.C.O.B.Y.",
  "status": "ONGOING",
  "startDate": "2026-01-21",
  "subtitle": {
    "tr": "Bakteri ve Mayanın Simbiyotik Kültürü",
    "en": "Symbiotic Culture Of Bacteria and Yeast",
    "de": "Symbiotische Kultur von Bakterien und Hefen",
    "es": "Cultivo Simbiótico de Bacterias y Levaduras"
  },
  "objective": {
    "tr": "Evsel atıklardan (çay posası) sürdürülebilir biyo-deri (vegan deri) üretimi ve dayanıklılık testi.",
    "en": "Production and durability testing of sustainable bio-leather (vegan leather) from household waste.",
    "de": "Herstellung und Haltbarkeitsprüfung von nachhaltigem Bio-Leder aus Haushaltsabfällen.",
    "es": "Producción y prueba de durabilidad de biocuero sostenible a partir de residuos domésticos."
  },
  "logs": {
    "tr": [
      "> [21.01.2026 - 22:30] Protokol başlatıldı (EXP-001).",
      "> [21.01.2026 - 22:45] Besiyeri hazırlandı: Dökme siyah çay ve sükroz çözeltisi kaynatıldı.",
      "> [21.01.2026 - 23:15] Soğutma tamamlandı. Ajan (Organik Elma Sirkesi) ile inokülasyon yapıldı.",
      "> [22.01.2026 - 10:00] İlk 12 saat: Yüzeyde karbon dioksit kabarcıkları gözlemlendi.",
      "> [23.01.2026 - 18:00] Ortamda keskinleşen asetik asit kokusu (pH düşüşü belirtisi).",
      "> [24.01.2026 - 12:00] Yüzeyde yağlı görünümlü, çok ince ve şeffaf bir katman oluşmaya başladı.",
      "> [25.01.2026 - 09:00] 5. GÜN: Selüloz ağı belirginleşiyor. Şeffaf film beyazlaşmaya başladı.",
      "> [DURUM] Polimerizasyon süreci stabil ilerliyor."
    ],
    "en": [
      "> [2026-01-21 - 22:30] Protocol initiated (EXP-001).",
      "> [2026-01-21 - 22:45] Nutrient media prepared: Loose black tea and sucrose solution boiled.",
      "> [2026-01-21 - 23:15] Cooling complete. Inoculation performed with agent (Organic Apple Cider Vinegar).",
      "> [2026-01-22 - 10:00] First 12h: Carbon dioxide bubbles observed on surface.",
      "> [2026-01-23 - 18:00] Sharpening acetic acid odor (sign of pH drop).",
      "> [2026-01-24 - 12:00] Oily-looking, very thin transparent layer started forming on surface.",
      "> [2026-01-25 - 09:00] DAY 5: Cellulose network becoming visible. Transparent film starting to turn white.",
      "> [STATUS] Polymerization process is proceeding stably."
    ]
  },
  "description": {
    "tr": "Bu deneyde, atık çay posası ve şeker kullanılarak 'Acetobacter Xylinum' bakterilerinin selüloz üretme yeteneği test edilmektedir.\n\nAmacımız, petrol türevi suni derilere alternatif, %100 doğada çözünebilen ve dikiş tutabilen biyolojik bir kumaş sentezlemektir. Reaktör, 20 gün boyunca karanlık ve titreşimsiz bir ortamda bekletilerek yüzeyde selüloz tabakasının (S.C.O.B.Y.) oluşumu gözlemlenecektir.",
    "en": "In this experiment, the cellulose-producing ability of 'Acetobacter Xylinum' bacteria is tested using waste tea pulp and sugar.\n\nOur goal is to synthesize a 100% biodegradable biological fabric that can be sewn, serving as an alternative to petroleum-based faux leathers. The reactor will be kept in a dark and vibration-free environment for 20 days to observe the formation of the cellulose layer (S.C.O.B.Y.) on the surface."
  },
  "growthData": {
    "currentDay": 5,
    "targetDay": 20,
    "progress": 25
  },
  "image": "images/scoby-day5.jpg"
}